'''
Вычислите в python значение выражения
9**19 - int(float(9**19))
'''

print(9**19 - int(float(9**19)))
